public class Main {
    public static void main(String[] args) {

        int price;
        price = 22000;
        int rub;
        rub = 20;
        int miles;
        miles = price / rub;

        System.out.println(miles);
        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной милли

        // Рассчитываете количество бонусных милль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}